20230709153923-protocol.org
:PROPERTIES:
:ID:       858e4c6c-e747-48da-840f-160e020b22c0
:END:
#+title: protocol
* 概要
情報技術におけるプロトコルは、マシンやソフトウェア同士のやりとりに関する取り決め。Web開発者にとってもっとも馴染みプロトコルに[[id:bccb3f96-0713-4347-b293-f49d860ce145][HTTP]]などがある。
* Memo
** ソケット通信
:LOGBOOK:
CLOCK: [2023-07-09 Sun 11:17]--[2023-07-09 Sun 11:42] =>  0:25
:END:

コネクション型通信であるTCPは、コンピュータ間に仮想的な通信路を作って通信する。TCPを利用した通信ではソケットを利用する。

ソケットを使う流れ。

1. ソケット生成
2. ソケット接続
3. ソケット通信
4. ソケット切断

一度通信接続が確立すると、クライアント・サーバに違いはない。お互いに書き込め、読み込める。
** SSL/TLSとは
SSL(Secure Socket Layer)は、公開鍵基盤(PKI)を使用して、データの暗号化と、2者間(通常はクライアントとサーバ間)の認証を可能にするプロトコル。LOSSLESは最初Netscapeによって策定され、そのあとIETFに引き継がれてTLSに改名された。HTTPS、すなわちHTTP over SSは実質的にはSSL/TLSコネクション上のHTTP。

SSL証明書はデータの暗号化と認証のために提供されている。SSL証明書は公開鍵などの情報を含み、X.509形式にまとめられた一片のデータでWebサーバに保管される。SSL証明書には通常、それが本物であることを証明する認証局(Certificate Authority: CA)の署名がある。クライアントがサーバにリクエストを出すと、サーバから証明書が返される。クライアントは、その証明書が本物であることを確認すると、ランダムな鍵を生成し、証明書(証明書内の公開鍵)を使ってその鍵を暗号化する。この対象鍵が、クライアントとサーバ側のデータを暗号化するのに使われる実際の鍵。

- X.509とは、公開鍵基盤(PKI)用のITU-Tによる標準規格。X.509には公開鍵証明書の標準書式が含まれている
- X.509証明書(日常的にSSL証明書とも呼ばれる)は、ASN.1で表記され符号化されたデジタル文書。ASN.1は通信とコンピュータネットワーキングの分野でデータを表現するための規則と構造を記述する規格と記法。X.509証明書は、さまざまな形式に符号化できる
- SSLでは証明書はいろいろな形式でファイルに保存できる。その1つがPEM(Privacy Enhanced Email)。Base64エンコードされたDER X.509証明書を"-----BEGIN CERTIFICATE-----"と"-----END CERTIFICATE-----"ではさんだもの
- HTTPSは、SSLの上にHTTPのレイヤーを置いただけのもの

参考。

- [[https://tatsu-zine.com/books/go-web-programming][Goプログラミング実践入門 標準ライブラリでゼロからWebアプリを作る]]
* Tasks
** TODO [[https://www.amazon.co.jp/Linux%E3%81%A7%E5%8B%95%E3%81%8B%E3%81%97%E3%81%AA%E3%81%8C%E3%82%89%E5%AD%A6%E3%81%B6TCP-IP%E3%83%8D%E3%83%83%E3%83%88%E3%83%AF%E3%83%BC%E3%82%AF%E5%85%A5%E9%96%80-%E3%82%82%E3%81%BF%E3%81%98%E3%81%82%E3%82%81-ebook/dp/B085BG8CH5][Linuxで動かしながら学ぶTCP/IPネットワーク入門 | もみじあめ | 一般・入門書 | Kindleストア | Amazon]]
ハンズオンで学べる本。
** TODO [[https://zenn.dev/arailly/books/41061020f0cfaa][パケットキャプチャで理解する TLS1.3]]
TLSを観察して理解する本。
** TODO [[https://www.slideshare.net/yhonjo/tcpudp-81497235][ネットワーク ゲームにおけるTCPとUDPの使い分け]]
使い分ける方法。
** TODO [[https://www.amazon.co.jp/dp/B073VDH5J8/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1][Amazon.co.jp: 日経ITエンジニアスクール TCP/IP最強の指南書 eBook : 日経NETWORK: Kindle Store]]
TCP/IPの教科書的な本。
** TODO [[https://zenn.dev/kawa1214/books/5888c6b3554ffa][Goでゼロから作る 自作TCP/IPプロトコル サーバー]]
自作してTCP/IPを理解する本。
** TODO [[https://booth.pm/ja/items/913273][プロフェッショナルIPv6（無料版） - Professional IPv6 - BOOTH]]
IPv6の本。
* Reference
** [[https://www.slideshare.net/yhonjo/tcpudp-81497235][ネットワーク ゲームにおけるTCPとUDPの使い分け | PPT]]
プロトコルに関してのスライド。
** [[https://gihyo.jp/book/2016/978-4-7741-8570-5][ポートとソケットがわかればインターネットがわかる――TCP/IP・ネットワーク技術を学びたいあなたのために：書籍案内｜技術評論社]]
TCP/IPの本。
* Archives
