20230709153923-protocol.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>protocol</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">protocol</h1>
<div id="outline-container-org481b0b6" class="outline-2">
<h2 id="org481b0b6"><a href="#org481b0b6">概要</a></h2>
<div class="outline-text-2" id="text-org481b0b6">
<p>
情報技術におけるプロトコルは、マシンやソフトウェア同士のやりとりに関する取り決め。Web開発者にとってもっとも馴染みプロトコルに<a href="20230514223733-http.html#ID-bccb3f96-0713-4347-b293-f49d860ce145">HTTP</a>などがある。
</p>
</div>
</div>
<div id="outline-container-orge027afd" class="outline-2">
<h2 id="orge027afd"><a href="#orge027afd">Memo</a></h2>
<div class="outline-text-2" id="text-orge027afd">
</div>
<div id="outline-container-org42768a0" class="outline-3">
<h3 id="org42768a0"><a href="#org42768a0">ソケット通信</a></h3>
<div class="outline-text-3" id="text-org42768a0">
<p>
コネクション型通信であるTCPは、コンピュータ間に仮想的な通信路を作って通信する。TCPを利用した通信ではソケットを利用する。
</p>

<p>
ソケットを使う流れ。
</p>

<ol class="org-ol">
<li>ソケット生成</li>
<li>ソケット接続</li>
<li>ソケット通信</li>
<li>ソケット切断</li>
</ol>

<p>
一度通信接続が確立すると、クライアント・サーバに違いはない。お互いに書き込め、読み込める。
</p>
</div>
</div>
<div id="outline-container-orgc7e9c69" class="outline-3">
<h3 id="orgc7e9c69"><a href="#orgc7e9c69">SSL/TLSとは</a></h3>
<div class="outline-text-3" id="text-orgc7e9c69">
<p>
SSL(Secure Socket Layer)は、公開鍵基盤(PKI)を使用して、データの暗号化と、2者間(通常はクライアントとサーバ間)の認証を可能にするプロトコル。LOSSLESは最初Netscapeによって策定され、そのあとIETFに引き継がれてTLSに改名された。HTTPS、すなわちHTTP over SSは実質的にはSSL/TLSコネクション上のHTTP。
</p>

<p>
SSL証明書はデータの暗号化と認証のために提供されている。SSL証明書は公開鍵などの情報を含み、X.509形式にまとめられた一片のデータでWebサーバに保管される。SSL証明書には通常、それが本物であることを証明する認証局(Certificate Authority: CA)の署名がある。クライアントがサーバにリクエストを出すと、サーバから証明書が返される。クライアントは、その証明書が本物であることを確認すると、ランダムな鍵を生成し、証明書(証明書内の公開鍵)を使ってその鍵を暗号化する。この対象鍵が、クライアントとサーバ側のデータを暗号化するのに使われる実際の鍵。
</p>

<ul class="org-ul">
<li>X.509とは、公開鍵基盤(PKI)用のITU-Tによる標準規格。X.509には公開鍵証明書の標準書式が含まれている</li>
<li>X.509証明書(日常的にSSL証明書とも呼ばれる)は、ASN.1で表記され符号化されたデジタル文書。ASN.1は通信とコンピュータネットワーキングの分野でデータを表現するための規則と構造を記述する規格と記法。X.509証明書は、さまざまな形式に符号化できる</li>
<li>SSLでは証明書はいろいろな形式でファイルに保存できる。その1つがPEM(Privacy Enhanced Email)。Base64エンコードされたDER X.509証明書を&ldquo;&#x2013;&#x2014;BEGIN CERTIFICATE&#x2013;&#x2014;&rdquo;と&ldquo;&#x2013;&#x2014;END CERTIFICATE&#x2013;&#x2014;&rdquo;ではさんだもの</li>
<li>HTTPSは、SSLの上にHTTPのレイヤーを置いただけのもの</li>
</ul>

<p>
参考。
</p>

<ul class="org-ul">
<li><a href="https://tatsu-zine.com/books/go-web-programming">Goプログラミング実践入門 標準ライブラリでゼロからWebアプリを作る</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgaf17ee3" class="outline-2">
<h2 id="orgaf17ee3"><a href="#orgaf17ee3">Tasks</a></h2>
<div class="outline-text-2" id="text-orgaf17ee3">
</div>
<div id="outline-container-orga768973" class="outline-3">
<h3 id="orga768973"><a href="#orga768973"><span class="todo TODO">TODO</span> <a href="https://www.amazon.co.jp/Linux%E3%81%A7%E5%8B%95%E3%81%8B%E3%81%97%E3%81%AA%E3%81%8C%E3%82%89%E5%AD%A6%E3%81%B6TCP-IP%E3%83%8D%E3%83%83%E3%83%88%E3%83%AF%E3%83%BC%E3%82%AF%E5%85%A5%E9%96%80-%E3%82%82%E3%81%BF%E3%81%98%E3%81%82%E3%82%81-ebook/dp/B085BG8CH5">Linuxで動かしながら学ぶTCP/IPネットワーク入門 | もみじあめ | 一般・入門書 | Kindleストア | Amazon</a></a></h3>
<div class="outline-text-3" id="text-orga768973">
<p>
ハンズオンで学べる本。
</p>
</div>
</div>
<div id="outline-container-orgacaf2dc" class="outline-3">
<h3 id="orgacaf2dc"><a href="#orgacaf2dc"><span class="todo TODO">TODO</span> <a href="https://zenn.dev/arailly/books/41061020f0cfaa">パケットキャプチャで理解する TLS1.3</a></a></h3>
<div class="outline-text-3" id="text-orgacaf2dc">
<p>
TLSを観察して理解する本。
</p>
</div>
</div>
<div id="outline-container-org3b7fdec" class="outline-3">
<h3 id="org3b7fdec"><a href="#org3b7fdec"><span class="todo TODO">TODO</span> <a href="https://www.slideshare.net/yhonjo/tcpudp-81497235">ネットワーク ゲームにおけるTCPとUDPの使い分け</a></a></h3>
<div class="outline-text-3" id="text-org3b7fdec">
<p>
使い分ける方法。
</p>
</div>
</div>
<div id="outline-container-orgc9c104e" class="outline-3">
<h3 id="orgc9c104e"><a href="#orgc9c104e"><span class="todo TODO">TODO</span> <a href="https://www.amazon.co.jp/dp/B073VDH5J8/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1">Amazon.co.jp: 日経ITエンジニアスクール TCP/IP最強の指南書 eBook : 日経NETWORK: Kindle Store</a></a></h3>
<div class="outline-text-3" id="text-orgc9c104e">
<p>
TCP/IPの教科書的な本。
</p>
</div>
</div>
<div id="outline-container-org150c95c" class="outline-3">
<h3 id="org150c95c"><a href="#org150c95c"><span class="todo TODO">TODO</span> <a href="https://zenn.dev/kawa1214/books/5888c6b3554ffa">Goでゼロから作る 自作TCP/IPプロトコル サーバー</a></a></h3>
<div class="outline-text-3" id="text-org150c95c">
<p>
自作してTCP/IPを理解する本。
</p>
</div>
</div>
<div id="outline-container-org51eda28" class="outline-3">
<h3 id="org51eda28"><a href="#org51eda28"><span class="todo TODO">TODO</span> <a href="https://booth.pm/ja/items/913273">プロフェッショナルIPv6（無料版） - Professional IPv6 - BOOTH</a></a></h3>
<div class="outline-text-3" id="text-org51eda28">
<p>
IPv6の本。
</p>
</div>
</div>
</div>
<div id="outline-container-org428f45c" class="outline-2">
<h2 id="org428f45c"><a href="#org428f45c">Reference</a></h2>
<div class="outline-text-2" id="text-org428f45c">
</div>
<div id="outline-container-orgadf069a" class="outline-3">
<h3 id="orgadf069a"><a href="#orgadf069a"><a href="https://www.slideshare.net/yhonjo/tcpudp-81497235">ネットワーク ゲームにおけるTCPとUDPの使い分け | PPT</a></a></h3>
<div class="outline-text-3" id="text-orgadf069a">
<p>
プロトコルに関してのスライド。
</p>
</div>
</div>
<div id="outline-container-org9bfbd88" class="outline-3">
<h3 id="org9bfbd88"><a href="#org9bfbd88"><a href="https://gihyo.jp/book/2016/978-4-7741-8570-5">ポートとソケットがわかればインターネットがわかる――TCP/IP・ネットワーク技術を学びたいあなたのために：書籍案内｜技術評論社</a></a></h3>
<div class="outline-text-3" id="text-org9bfbd88">
<p>
TCP/IPの本。
</p>
</div>
</div>
</div>
<div id="outline-container-orgfb77f34" class="outline-2">
<h2 id="orgfb77f34"><a href="#orgfb77f34">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
